"""
6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет и наличие лекционных,
практических и лабораторных занятий по этому предмету и их количество.
Важно, чтобы для каждого предмета не обязательно были все типы занятий.
Сформировать словарь, содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
Примеры строк файла:
Информатика: 100(л) 50(пр) 20(лаб).
Физика: 30(л) — 10(лаб)
Физкультура: — 30(пр) —

Пример словаря:
{“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
"""

subject = {}
with open('homework_5.6.txt', 'r', encoding='utf-8') as r:
    for classes in r:
        data = classes.split(':')
        hours = [int(num.split('(')[0]) for num in data[1].split() if num.split('(')[0].isdigit()]
        subject[data[0]] = sum(hours)
print(subject)
